{"inkVersion":21,"root":[["^The Debate Club was quiet other than the students watching the ongoing debate. One student had stood out to you, and that was the one that had a very baggy green jumper.","\n","^They were very bold and firm, slamming down their opponents mercilessly as the debates went on. They definitely peaked your interest.","\n","^You had approached them after the debate had ended and the club was packing up for the day and they stared at you, raising an eyebrow.","\n","^Holding a water bottle in one hand, they had stared at you expectantly.","\n","^???: \"Can I help you?\"","\n","^They asked with a snarky tone in their voice. It sort of surprised you and it influenced how you responded to them.","\n","ev","str","^Ignore how rude they are","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Be Nice","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Be rude","/str","/ev",{"*":"0.c-2","flg":20},{"c-0":["^ ",{"->":"Ignore"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Nice"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Rude"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Ignore":["^Their eyes narrowed, shining with impatience. They clearly do not want to speak to you.","\n","^You: \"You did well in that debate.\"","\n","^That seemed to have caught their attention and they stopped what they were doing, attentive eyes looking all over you. They looked as if they were waiting for a catch.","\n","^Slowly, they replied...","\n","^???: \"...Thanks.\"","\n","^Their voice was barely over a mumble, posture loosening. Now, they looked at your eyes with no anger or impatience. They seemed like a whole new person.","\n","done",{"#f":1}],"Nice":["^Their eyes narrowed, shining with impatience. They clearly do not want to speak to you.","\n","^???: \"Hi!\"","\n","^You said sweetly, seeing how their expression turned more deadpan as the seconds go by","\n","^You: \"I'm-.\"","\n","^???: \"Stop being fake nice to me it's annoying.\"","\n","^They interrupted, huffing as they swung their bag on their shoulder. You stared, instantly frowning. So much for being nice.","\n","done",{"#f":1}],"Rude":[["^Their eyes narrowed, shining with impatience. They clearly do not want to speak to you.","\n","^You: \"No need for the attitude.\"","\n","^You had said, folding your arms.","\n","^Their own eyes had widened","\n","^???: \"What..?\"","\n","^Her voice came out like a warning, looking genuinely pissed.","\n","done","^This person seemed to be very impatient so you wasted no time and","\n","^spoke.","\n","^You: \"Alright, my name is ","ev",{"VAR?":"playerName"},"out","/ev","^. I need some volunteers for my last essay in Philosophy, and I was wondering if you'd be interested in being one?\"","\n","^They had blinked a few times before sighing at you.","\n","^???: \"You're asking me, a random person you don't know at all who you've seen in a debate once, to take apart in a random research paper?\"","\n","ev","str","^Yeah...You're the perfect choice","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^That's a good point","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Maybe this was a mistake","/str","/ev",{"*":".^.c-2","flg":20},{"c-0":["^ ",{"->":"Choice"},"\n",{"#f":5}],"c-1":["^ ",{"->":"GoodPoint"},"\n",{"#f":5}],"c-2":["^ ",{"->":"Mistake"},"\n",{"#f":5}]}],{"#f":1}],"Choice":["^You: \"Yeah you're a perfect choice!\"","\n","^You said matter of factly. They just looked at you, an unreadable expression on their face, before they looked awkwardly to the side. It was evident that they felt embarrassed.","\n","^They coughed.","\n","^???: \"...I see.\"","\n","^They replied so slowly, hand covering their mouth as they looked away. It was time to change the topic, you thought","\n","done",{"#f":1}],"GoodPoint":["^You thought for a moment when she pointed that out, suddenly seeing things from her perspective and seeing how rushed you were being with this. Looking away, you sighed.","\n","^You: \"That's a good point.\"","\n","^You finally say.","\n","^You: \"However, I still think you'd be good candidate for my essay.\"","\n","^All they did was sigh, nodding as they looked back at you. You took that as a positive sign","\n","done",{"#f":1}],"Mistake":["^Once she pointed out what you were doing it sounded sort of absurd. With a crumbling resolve, you nodded hesitantly.","\n","^You: \"Maybe you're right...\"","\n","^You muttered.","\n","^You: \"Maybe this was a mistake.\"","\n","^They had rolled their eyes at you with a sigh.","\n","^???: \"I was only testing you.\"","\n","^They admitted","\n","^???: \"I needed to check if you were serious about this. Seriously, grow some balls.\"","\n","done","^???: \"Fine, I'll be one of your candidates...\"","\n","^You stared at them in surprise. You didn't think you had convinced them well enough, yet here they are agreeing to participate.","\n","^You: \"Oh? Really?\"","\n","^You let your surprise seep through your response to them and they raised a brow at you.","\n","^???: \"I have nothing better to do.\"","\n","^They added on with a shrug. Ahh, you thought, that makes sense.","\n","^Genesis: \"My name is Genesis by the way.\"","\n","^She said after a while.","\n","^Genesis: \"I do Digital Art here.\"","\n","^With a soft and friendly smile, you said,","\n","^You: \"It's nice to meet you.\"","\n","^With that you had give them the first question for your essay. They hummed in thought as if they were already wondering how to answer it which made you a bit relieved.","\n","^You had said goodbye to them after you made sure they knew how to answer it, and went on your way.","\n","end",{"#f":1}],"global decl":["ev","str","^Player","/str",{"VAR=":"playerName"},"/ev","end",null],"#f":1}],"listDefs":{}}