{"inkVersion":21,"root":[["^You pass by a door, but stop at the sounds of shouts coming from within. You had peered in from the entrance, seeing a bunch of people, mostly men, cheer on what you presumed were people fighting.","\n","^A loud round of cheers resounded, and suddenly, a guy could be seen from the middle fist pumping the air in triumph. He seemed to revel in the crowd's love and adoration and it made you stare.","\n","^When the next match started, you managed to find that same guy. He still had his wrestling attire on, a towel over his shoulders as he seemed to be resting from his match.","\n","^He turned to you after noticed you, and his eyes lit up.","\n","^???: \"Hello!\" he chirped happily, before looking at your attire, looking confused \"Are you even a member here?\"","\n","ev","str","^Say you're a fan","/str","/ev",{"*":"0.c-0","flg":20},"ev","str","^Tell the truth","/str","/ev",{"*":"0.c-1","flg":20},"ev","str","^Lie","/str","/ev",{"*":"0.c-2","flg":20},{"c-0":["^ ",{"->":"Fan"},"\n",{"->":"0.g-0"},{"#f":5}],"c-1":["^ ",{"->":"Truth"},"\n",{"->":"0.g-0"},{"#f":5}],"c-2":["^ ",{"->":"Lie"},"\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"Fan":["^You looked at him and made a split decision as you opened your mouth to speak.","\n","^You: \"I'm sorry,\"","\n","^You said with a smile.","\n","^You: \"I'm just such a big fan of you, I had to just talk to you. You did so well today!\"","\n","^His eyes widened, and so did his smile, a glow coming from him as he basically basked in your praise. Ah...so he was one of those people","\n","done",{"#f":1}],"Truth":["^You: \"I need you with help for something.\"","\n","^You say honestly, watching as his eyes dimmed and his posture shifted, relaxing.","\n","^???: \"Oh?\"","\n","^He said, his voice and volume deflating like a balloon.","\n","^???: \"You need my help? Why?\"","\n","done",{"#f":1}],"Lie":["^You: \"Oh yeah I'm in the club too.\"","\n","^You quickly blurt out, watching as his face turned confused.","\n","^He looked you up and down...then up and down again. You suddenly felt yourself get self conscious at him staring at you.","\n","^You weren't that unfit... Raising his eyebrows he said,","\n","^???: \"Yeah...I don't believe you. Why are you really here?\"","\n","^You sighed, you should have known that saying a lie would be a stupid idea","\n","done","^You: \"My name is ","ev",{"VAR?":"playerName"},"out","/ev","^.\"","\n","^You had said, watching as his face started to change from realisation.","\n","^You: \"I need some volunteers for my last essay in Philosophy, and I was wondering if you'd be interested in being one?\"","\n","^He looked so nice as he smiled kindly at you, nodding as he replied.","\n","^Faust: \"Of course! I'd love to help you! I'm Faust by the way. Let's discuss the details.\"","\n","^It took a few minutes to go through everything, and he had been agreed without no problems. He also mentioned he did Computer Sciences at the University which surprised you.","\n","^You left after saying goodbye, leaving the room. Out of all the candidates so far, he seemed the most normal.","\n",{"#f":1}],"global decl":["ev","str","^Player","/str",{"VAR=":"playerName"},"/ev","end",null],"#f":1}],"listDefs":{}}