{"inkVersion":21,"root":[["^You sigh as you entered the building. Everything will be fine.","\n","^Everything was, in fact, not fine.","\n","^You: \"I really won't graduate?\"","\n","^You had repeated, sittinging across from your professor who was looking at you with the sort of pity that you wanted to scratch off his face.","\n","^Just seconds ago, your professor had announced the new essay question to the whole class, the last one of the year and the entire course.","\n","^The end justifies the means' Does Niccolò Machiavelli's statement ring true still in the youth today'","\n","^Professor: \"This is your last essay...\"","\n","^Professor: \"And, for you, will very much be your deciding factor on if you graduate on not...\"","\n","^So this is why you were sitting in your Professor's room, discussing the future of your grade. His office was filled with bookcases of all sorts, but mostly books pertaining to the human psyche and mind. It made sense for a man like him who taught philosophy, but you'd maybe gamble the sheer volume was half for show...","\n","^Professor: \" This essay is your only chance to pull your grade high enough in order to graduate...\"","\n","^The Professor said, hands clasped in front of him with his eyes furrowed in pity. Or concern. Both seemed the same to you, and both emotions wanted you to walk out of that room right away.","\n",["ev",{"^->":"0.22.$r1"},{"temp=":"$r"},"str",{"->":".^.s"},[{"#n":"$r1"}],"/str","/ev",{"*":"0.c-0","flg":18},{"s":["^\"I understand, sir...\"",{"->":"$r","var":true},null]}],{"c-0":["ev",{"^->":"0.c-0.$r2"},"/ev",{"temp=":"$r"},{"->":"0.22.s"},[{"#n":"$r2"}],"\n","^You grumbled, looking away and hands folded as you glanced out the window onto the rainy evening outside.","\n","^You sighed softly as he repeats a similar reprimand of urgency about the whole situation. You really wished you didn't care, but for some reason you still did. How annoying...","\n","^Professor: \"Now, I'm going to give you a head start to help you out here...\"","\n","^With that your head perked up.","\n","^Professor: \"You have potential, I know you do, you just need to apply yourself!\"","\n","^You have heard that phrase too much to count. Despite nearly rolling your eyes, you just smiled politely and nodded. You would be a fool to waste this opportunity.","\n","^Professor: \"Go find five candidates for the essay. If you find five people today, you'll be on track with everyone in the following weeks...\"","\n","^He said, leading you out of the office and to the main part of the building","\n","^Professor: \"If you don't know who to pick for candidates, head around the clubs or cafe on campus. There's plenty of...characters...at this place so...should be perfect for a psychology paper!\"","\n","^You had nodded, looking at him before you found yourself out of the building.","\n",{"->":"0.g-0"},{"#f":5}],"g-0":["done",{"#f":5}]}],"done",{"#f":1}],"listDefs":{}}